Examinator/src/ExchangePlans/ОбменМатериаламиСУЗ/ОбменМатериаламиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="9bc99607-c6e6-435f-9cd6-d09156ac3541">
  <name>ОбменМатериаламиСУЗ</name>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПакетаДанных</name>
    <type>
      <types>EnumRef.ТипыПакетовДанныхСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПакетДляЭкспорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьДанныеДоДаты</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьДанныеПослеДаты</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьТолькоПомеченныеНаУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранитьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИмпортированныйПакет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИмпортИзКаталогаШаблонов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРедакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодредакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлементыДляЭкспорта</name>
    <attributes>
      <name>СсылкаНаЭлемент</name>
      <type>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.СодержаниеСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопустимыеПакетыДанных</name>
    <attributes>
      <name>НомерПакетаДанных</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПакетДанных</name>
      <type>
        <types>ExchangePlanRef.ОбменМатериаламиСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

Examinator/src/InformationRegisters/ИмпортированныеЭлементыПакетаSCORM/ИмпортированныеЭлементыПакетаSCORM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИмпортированныеЭлементыПакетаSCORM</name>
  <resources>
    <name>ИдентификаторПакета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаЭлемент</name>
    <type>
      <types>ExchangePlanRef.ОбменМатериаламиСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыЭлектронныхРесурсовСУЗ/ТипыЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлектронныхРесурсовСУЗ</name>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйКурс</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыПакетовДанныхСУЗ/ТипыПакетовДанныхСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПакетовДанныхСУЗ</name>
  <enumValues>
    <name>XML_V8</name>
  </enumValues>
  <enumValues>
    <name>SCORM_2004</name>
  </enumValues>
  <enumValues>
    <name>E4HOME</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыОбъектовСУЗ/ТипыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовСУЗ</name>
  <enumValues>
    <name>collection</name>
  </enumValues>
  <enumValues>
    <name>file</name>
  </enumValues>
  <enumValues>
    <name>frame</name>
  </enumValues>
  <enumValues>
    <name>glossary</name>
  </enumValues>
  <enumValues>
    <name>knowledgeBase</name>
  </enumValues>
  <enumValues>
    <name>map</name>
  </enumValues>
  <enumValues>
    <name>page</name>
  </enumValues>
  <enumValues>
    <name>question</name>
  </enumValues>
  <enumValues>
    <name>res</name>
  </enumValues>
  <enumValues>
    <name>term</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыФайловСУЗ/ТипыФайловСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыФайловСУЗ</name>
  <enumValues>
    <name>Default</name>
  </enumValues>
  <enumValues>
    <name>Folder</name>
  </enumValues>
  <enumValues>
    <name>Media</name>
  </enumValues>
  <enumValues>
    <name>Image</name>
  </enumValues>
  <enumValues>
    <name>Video</name>
  </enumValues>
  <enumValues>
    <name>Audio</name>
  </enumValues>
  <enumValues>
    <name>Document</name>
  </enumValues>
  <enumValues>
    <name>DataProcessor</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ДействияПослеИстеченияВремениВыполненияОбъектаSCORM/ДействияПослеИстеченияВремениВыполненияОбъектаSCORM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДействияПослеИстеченияВремениВыполненияОбъектаSCORM</name>
  <comment>timeLimitAction</comment>
  <enumValues>
    <name>Выйти</name>
    <comment>exit,no message</comment>
  </enumValues>
  <enumValues>
    <name>СообщитьИВыйти</name>
    <comment>exit,message</comment>
  </enumValues>
  <enumValues>
    <name>ПродолжитьРаботу</name>
    <comment>continue,no message</comment>
  </enumValues>
  <enumValues>
    <name>СообщитьИПродолжитьРаботу</name>
    <comment>continue,message</comment>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/РесурсыСУЗ/РесурсыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РесурсыСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Общие</name>
      <description>Общие</description>
    </items>
    <items>
      <name>Служебные</name>
      <description>Служебные</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентичныйРесурс</name>
    <comment>Важно! Данный реквизит должен стоять перед реквизитом ФайлЗапуска, так как при экспорте необходимо сначала зарегистрировать идентичный ресурс, а потом файл, иначе ресурс будет экспортирован не полностью.</comment>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЗапуска</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯкорьЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SCO</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Интерактивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключитьAPI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдинственныйФайл</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/ExchangePlans/ОбменМатериаламиСУЗ/Forms/ФормаИмпортаПакетаSCORM/Module.bsl
#Область ОписаниеПеременных

&НаСервере
Перем МанифестXDTO;

&НаСервере
Перем ТаблицаРанееИмпортированныхЭлементов;

#КонецОбласти

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Делаем проверки
	
	Если НЕ ЗначениеЗаполнено(Параметры.ПутьКФайлуПакета) Тогда
		Текст = НСтр("ru = 'Путь к файлу пакета данных не передан!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	ПутьКФайлуПакета = Параметры.ПутьКФайлуПакета;	
	ФайлПакета = Новый Файл(ПутьКФайлуПакета);
	РазмерФайлаПакета = Окр(ФайлПакета.Размер() / 1048576);

	// Получаем временный каталог
	
	ПутьКРесурсамБезБазовыхПутей = ПолучитьИмяВременногоФайла("");
	ПутьКРесурсамБезБазовыхПутей = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКРесурсамБезБазовыхПутей);
	
	Попытка
		СоздатьКаталог(ПутьКРесурсамБезБазовыхПутей);
	Исключение
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка создания каталога ""%1""'"), ПутьКРесурсамБезБазовыхПутей);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		Возврат;
	КонецПопытки;
	
	// Распаковываем пакет
	
	Попытка
		ФайлАрхива = Новый ЧтениеZIPФайла(ПутьКФайлуПакета);
		ФайлАрхива.ИзвлечьВсе(ПутьКРесурсамБезБазовыхПутей, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
		ФайлАрхива.Закрыть(); 				
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(),,,,Отказ);
		Возврат;
	КонецПопытки;
	
	// Получаем пути
	
	ПутьКФайлуМанифеста = ПутьКРесурсамБезБазовыхПутей + "imsmanifest.xml";
	
	ФайлМанифеста = Новый Файл(ПутьКФайлуМанифеста);
	
	Если НЕ ФайлМанифеста.Существует() Тогда
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Файл ""%1"" не существует!'"), ФайлМанифеста.ПолноеИмя);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	// Читаем пакет и получаем общие для пакета параметры
	
	МанифестXDTO = ПолучитьМанифестXDTO();
	
	// Проверяем корректность пакета
	
	Если МанифестXDTO.Свойства().Получить("organizations") = Неопределено Тогда
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Импорт пакета SCORM без узла organizations не поддерживается'"), ФайлМанифеста.ПолноеИмя);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	// Получаем полный путь к ресурсам с учетом базовых путей	
	// Примечание: путь должен содержать только допустимые символы. Декодирование URL не выполняется.
	
	БазовыйПутьКРесурсам = Строка(МанифестXDTO.base) + Строка(МанифестXDTO.resources.base);	
	
	ПутьКРесурсам = ПутьКРесурсамБезБазовыхПутей + БазовыйПутьКРесурсам; // Учитываем базовые пути
	ПутьКРесурсам = СтрЗаменить(ПутьКРесурсам, "/", "\");
	ПутьКРесурсам = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКРесурсам);
	
	// Получаем относительный путь к ресурсам с учетом базовых путей
	
	ОтносительныйПутьКРесурсам = "" + МанифестXDTO.base + МанифестXDTO.resources.base;
	ОтносительныйПутьКРесурсам = СтрЗаменить(ОтносительныйПутьКРесурсам, "/", "\");
	
	// Идентификатор пакет
	
	ИдентификаторПакета = МанифестXDTO.identifier;
	НаименованиеОрганизации = ОрганизацияДляЗагрузки().title;
	
	// Заполняем электронные ресурсы для замены
	
	ЗаполнитьЭлектронныеРесурсыДляЗамены();	
	
	// Устанавливаем видимость элементов
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ЭлектронныйРесурсДляЗаменыПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВыполнитьИмпорт(Команда)
	
	ВыполнитьИмпортПакетаДанных();
	
	Оповестить("ЭлектронныйРесурсЗаписан");
	Оповестить("ЭлектронныйРесурсОбновлен", ЭлектронныйРесурсДляЗамены);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьИмпортЗавершение", ЭтотОбъект);
	ПоказатьПредупреждение(ОписаниеОповещения, НСтр("ru = 'Импорт пакета успешно завершен'"));
			
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИмпортЗавершение(ДополнительныеПараметры) Экспорт	
	Закрыть();		
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЭлектронныйРесурсДляЗамены(Команда)
	ВыбратьИзТаблицыЭлектронныйРесурсДляЗамены();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЭлектронныеРесурсыДляЗамены

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ЭлектронныеРесурсыДляЗамены

&НаКлиенте
Процедура ЭлектронныеРесурсыДляЗаменыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЭлектронныеРесурсыДляЗамены.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(,ТекущиеДанные.ЭлектронныйРесурс);
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выбор электронного ресурса для замены

&НаКлиенте
Процедура ВыбратьИзТаблицыЭлектронныйРесурсДляЗамены()
	
	ТекущиеДанные = Элементы.ЭлектронныеРесурсыДляЗамены.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныйРесурсДляЗамены = ТекущиеДанные.ЭлектронныйРесурс;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

// Импорт ресурсов и файлов

&НаСервере
Функция ПолучитьМанифестXDTO() 
	
	Если МанифестXDTO = Неопределено Тогда
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ПутьКФайлуМанифеста);

		МанифестТип  = ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "manifestType");
		МанифестXDTO = ФабрикаXDTO.Создать(МанифестТип);
		МанифестXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, МанифестТип);
		
	КонецЕсли;
	
	Возврат МанифестXDTO;
	
КонецФункции

&НаСервере
Процедура ВыполнитьИмпортПакетаДанных()
	
	НачатьТранзакцию();
	
	Попытка
		
		// Получаем манифест пакета в виде модели XDTO
		
		МанифестXDTO = ПолучитьМанифестXDTO();
		
		// Создаем электронный ресурс для замены
		
		БылСозданНовыйЭлектронныйРесурс = Ложь;
		
		Если ЗначениеЗаполнено(ЭлектронныйРесурсДляЗамены) Тогда
			
			ЭлектронныйРесурсДляЗаменыОбъект = ЭлектронныйРесурсДляЗамены.ПолучитьОбъект();
			ЭлектронныйРесурсДляЗаменыОбъект.Записать(); // Обновляем дату
			
		Иначе
				
			ЭлектронныйРесурсДляЗаменыОбъект = Справочники.СводыЗнанийСУЗ.СоздатьЭлемент();
			ЭлектронныйРесурсДляЗаменыОбъект.Наименование = НаименованиеОрганизации;
			ЭлектронныйРесурсДляЗаменыОбъект.Тип = Перечисления.ТипыЭлектронныхРесурсовСУЗ.ЭлектронныйКурс;
			РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ЭлектронныйРесурсДляЗаменыОбъект);			
			ЭлектронныйРесурсДляЗаменыОбъект.Записать();
			
			ЭлектронныйРесурсДляЗамены = ЭлектронныйРесурсДляЗаменыОбъект.Ссылка;
			БылСозданНовыйЭлектронныйРесурс = Истина;
			
		КонецЕсли; 
		
		ЗапомнитьИмпортЭлемента(ЭлектронныйРесурсДляЗамены, ОрганизацияДляЗагрузки().identifier, "organization");
		
		// Получаем узел плана обмена
		
		СсылкаНаУзел = ПолучитьРанееИмпортированныйЭлемент("", "manifest");
		
		Если ЗначениеЗаполнено(СсылкаНаУзел) Тогда
			УзелОбъект = СсылкаНаУзел.ПолучитьОбъект();
		Иначе
			УзелОбъект = ПланыОбмена.ОбменМатериаламиСУЗ.СоздатьУзел();
			УзелОбъект.Наименование = НаименованиеОрганизации;
			УзелОбъект.Код = Новый УникальныйИдентификатор();
			УзелОбъект.ЭтоИмпортированныйПакет = Истина;
			УзелОбъект.ТипПакетаДанных = Перечисления.ТипыПакетовДанныхСУЗ.SCORM_2004;
		КонецЕсли;
		
		УзелОбъект.Записать(); // Обновляем дату изменения
		
		ЗапомнитьИмпортЭлемента(УзелОбъект.Ссылка, "", "manifest");
			
		// Создаем группу ресурсов в которую будут помещаться ресурсы пакета.
		
		СсылкаНаСуществующийЭлемент = ПолучитьРанееИмпортированныйЭлемент("", "resources", Истина);
		
		Если ЗначениеЗаполнено(СсылкаНаСуществующийЭлемент) Тогда
			ГруппаРесурсов = СсылкаНаСуществующийЭлемент.ПолучитьОбъект();
		Иначе
			ГруппаРесурсов = Справочники.РесурсыСУЗ.СоздатьГруппу();
			ГруппаРесурсов.Наименование = НаименованиеОрганизации;
			РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ГруппаРесурсов);
		КонецЕсли;
				
		ГруппаРесурсов.Записать();
		
		ЗапомнитьИмпортЭлемента(ГруппаРесурсов.Ссылка, "", "resources");
			
		// Получаем и сохраняем ресурс, в котором будут хранится все файлы пакета.
		
		СсылкаНаСуществующийЭлемент = ПолучитьРанееИмпортированныйЭлемент("", "resources", Ложь);
		
		Если ЗначениеЗаполнено(СсылкаНаСуществующийЭлемент) Тогда
			РесурсСоВсемиФайламиОбъект = СсылкаНаСуществующийЭлемент.ПолучитьОбъект();
		Иначе
			РесурсСоВсемиФайламиОбъект              = Справочники.РесурсыСУЗ.СоздатьЭлемент();
			РесурсСоВсемиФайламиОбъект.Наименование = "Все файлы пакета " + НаименованиеОрганизации;
			РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(РесурсСоВсемиФайламиОбъект);
		КонецЕсли;
		
		РесурсСоВсемиФайламиОбъект.Родитель = ГруппаРесурсов.Ссылка;
				
		РесурсСоВсемиФайламиОбъект.Записать();
		
		ЗапомнитьИмпортЭлемента(РесурсСоВсемиФайламиОбъект.Ссылка, "", "resources");
		
		// Сохраняем файлы в ресурс
		
		// Примечание: файлы берутся из каталога ресурсов пакета,
		// а не из каталога пакета. Каталог ресурсов - это каталог пакета
		// плюс базовые пути манифеста и ресурсов.
		// Это следует учитывать при поиске файла в ресурсе.
		
		КаталогЗагрузки = Новый Файл(ПутьКРесурсам);
		
		Если КаталогЗагрузки.Существует() И КаталогЗагрузки.ЭтоКаталог() Тогда
			ПоместитьВсеФайлыПакетаВОдинРесурс(РесурсСоВсемиФайламиОбъект.Ссылка,, КаталогЗагрузки);
		Иначе
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Каталог не найден ""%1"".'"), ПутьКРесурсам);
			ВызватьИсключение Текст;
		КонецЕсли;
		
		// Перебираем ресурсы и помещаем их в созданную группу.
		
		НомерВыгружаемогоРесурса = 0;
		
		Для каждого РесурсПакета Из МанифестXDTO.resources.resource Цикл
			
			// Получаем параметры ресурса из пакета SCORM
			
			ИдентификаторРесурса = РесурсПакета.identifier;
			
			// Создаем (или используем существующий) ресурс в базе для записи файлов ресурса SCORM пакета.
			
			СсылкаНаСуществующийРесурс = ПолучитьРанееИмпортированныйЭлемент(ИдентификаторРесурса, "resource");
			
			Если ЗначениеЗаполнено(СсылкаНаСуществующийРесурс) Тогда
				Ресурс = СсылкаНаСуществующийРесурс.ПолучитьОбъект();
			Иначе
				Ресурс = Справочники.РесурсыСУЗ.СоздатьЭлемент();
				Ресурс.Наименование = ИдентификаторРесурса;
				Ресурс.Родитель = ГруппаРесурсов.Ссылка;
				РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Ресурс);
			КонецЕсли;
						
			Ресурс.ИдентичныйРесурс = РесурсСоВсемиФайламиОбъект.Ссылка;
			
			Если НРег(РесурсПакета.scormType) = "sco" Тогда
				Ресурс.SCO = Истина;
			КонецЕсли;
			
			Ресурс.Записать();
			
			ЗапомнитьИмпортЭлемента(Ресурс.Ссылка, ИдентификаторРесурса, "resource");
						
			НомерВыгружаемогоРесурса = НомерВыгружаемогоРесурса + 1;
			
		КонецЦикла; // Перебор ресурсов пакета
		
		// Второй раз перебираем ресурсы, чтобы сохранить зависимые ресурсы и стартовый ресурс.
		// Второй раз надо, чтобы гарантированно все ресурсы от которых зависят ресурсы
		// были уже сохранены.
		
		НомерВыгружаемогоРесурса = 0;
		Для каждого РесурсПакета Из МанифестXDTO.resources.resource Цикл
			
			ИдентификаторРесурса = РесурсПакета.identifier;
			
			СсылкаНаРесурс = ПолучитьРанееИмпортированныйЭлемент(ИдентификаторРесурса, "resource");
			
			// Указываем стартовый файл ресурса, если он указан
			
			Если РесурсПакета.href <> Неопределено Тогда
				
				// Находим пусть к стартовому файлу и вычленяем из него параметры запуска и якорь
				
				ПутьКСтартовомуФайлу = "" + РесурсПакета.base + РесурсПакета.href;
				
				ПозицияПараметров = Найти(ПутьКСтартовомуФайлу, "?");
				ПозицияЯкоря      = Найти(ПутьКСтартовомуФайлу, "#");
				
				Если ПозицияПараметров > 0 Тогда // Параметры всегда идут до якоря
					
					ПолныйПуть           = ПутьКСтартовомуФайлу;
					ПутьКСтартовомуФайлу = Сред(ПутьКСтартовомуФайлу, 1, ПозицияПараметров - 1);
					
					Если ПозицияЯкоря > 0 Тогда
						ПараметрыЗапуска = Сред(ПолныйПуть, ПозицияПараметров+1, ПозицияЯкоря-ПозицияПараметров-1);
						ЯкорьЗапуска     = Сред(ПолныйПуть, ПозицияЯкоря+1, СтрДлина(ПолныйПуть) - ПозицияЯкоря);
					Иначе
						ПараметрыЗапуска = Сред(ПолныйПуть, ПозицияПараметров+1, СтрДлина(ПолныйПуть) - ПозицияПараметров);
						ЯкорьЗапуска     = "";
					КонецЕсли;
					
				Иначе
					
					ПараметрыЗапуска = "";
					
					Если ПозицияЯкоря > 0 Тогда
						ЯкорьЗапуска         = Сред(ПутьКСтартовомуФайлу, ПозицияЯкоря+1, СтрДлина(ПутьКСтартовомуФайлу) - ПозицияЯкоря);
						ПутьКСтартовомуФайлу = Сред(ПутьКСтартовомуФайлу, 1, СтрДлина(ПутьКСтартовомуФайлу) - 1);
					Иначе
						ЯкорьЗапуска         = "";
					КонецЕсли;
					
				КонецЕсли;
				
				ПутьКСтартовомуФайлу = СтрЗаменить(ПутьКСтартовомуФайлу, "/", "\");
				ИсточникСтартовогоФайла = РесурсСоВсемиФайламиОбъект;
				ДеревоВсехФайловРесурса  = Справочники.РесурсыСУЗ.ДеревоФайлов(ИсточникСтартовогоФайла.Ссылка);
				
				СтартовыйФайл = НайтиВДеревеФайлов(ДеревоВсехФайловРесурса, ПутьКСтартовомуФайлу);
				
				Если СтартовыйФайл = Неопределено Тогда
					Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Стартовый файл не найден (%1).'"), ИдентификаторРесурса);
					ВызватьИсключение Текст;
				КонецЕсли;
				
				РесурсОбъект = СсылкаНаРесурс.ПолучитьОбъект();
				РесурсОбъект.ФайлЗапуска      = СтартовыйФайл;
				РесурсОбъект.ЯкорьЗапуска     = ЯкорьЗапуска;
				РесурсОбъект.ПараметрыЗапуска = ПараметрыЗапуска; 
				РесурсОбъект.Записать();
				
			КонецЕсли;
			
			НомерВыгружаемогоРесурса = НомерВыгружаемогоРесурса + 1;
			
		КонецЦикла; // Второй перебор ресурсов пакета
		
		// Формируем электронный ресурс
		
		Организация = ОрганизацияДляЗагрузки();
		ИдентификаторОрганизации = Организация.identifier;
		
		СводЗнанийОбъект = ЭлектронныйРесурсДляЗамены.ПолучитьОбъект();
		
		СтрокаТЧЗР = СводЗнанийОбъект.СкрытыеРесурсы.Найти(РесурсСоВсемиФайламиОбъект.Ссылка, "Ресурс");
		
		Если СтрокаТЧЗР = Неопределено Тогда
			СтрокаТЧЗР = СводЗнанийОбъект.СкрытыеРесурсы.Добавить();
		КонецЕсли;
		
		СтрокаТЧЗР.Ресурс = РесурсСоВсемиФайламиОбъект.Ссылка;
		СтрокаТЧЗР.Размер = РазмерФайлаПакета;
		СтрокаТЧЗР.ВыгружатьПриОткрытии = Истина;

		ЗапомнитьИмпортЭлемента(СводЗнанийОбъект.Ссылка, ИдентификаторОрганизации, "organization");
		
		// Сохраняем элементы свода знаний

		ИмпортироватьЭлементыОрганизацииКонтентаSCORM(СводЗнанийОбъект.Ссылка,,Организация.item, МанифестXDTO.resources.resource);
		
		// Завершаем
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		Если БылСозданНовыйЭлектронныйРесурс Тогда
			ЭлектронныйРесурсДляЗамены = Неопределено;	
		КонецЕсли;
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	ЭлектронныеРесурсыПереопределяемый.ПослеЗагрузкиЭлектронногоРесурса();
	
	ОчиститьВременныйКаталогРесурсов();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьВременныйКаталогРесурсов()
	
	ПутьККаталогуДляОчистки = ОбщегоНазначенияСУКлиентСервер.УбратьКонечныйРазделительПути(ПутьКРесурсамБезБазовыхПутей);
	
	Попытка
		УдалитьФайлы(ПутьККаталогуДляОчистки);
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КонструкторКурсов.SCORM'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

// Процедура рекурсивно выбирает ВСЕ файлы из указанного каталога и помещает в указанный ресурс.
//
&НаСервере
Процедура ПоместитьВсеФайлыПакетаВОдинРесурс(Ресурс, Родитель, КаталогДляЗагрузки)
	
	МассивФайлов = НайтиФайлы(КаталогДляЗагрузки.ПолноеИмя, "*");
	
	Для каждого Файл Из МассивФайлов Цикл
		
		// Ищем существующий файл
		
		СсылкаНаФайл = ПолучитьСуществующийФайл(Ресурс, Родитель, Файл.Имя, Файл.ЭтоКаталог());
			
		// Получаем объект файла
		
		ЗаписанныйФайлОбъект = ЗаписатьФайлПакетаВРесурс(Файл, Ресурс, Родитель, СсылкаНаФайл);
		
		// Рекурсивно вызываем эту функцию для подчиненных файлов
		
		Если Файл.ЭтоКаталог() Тогда
			ПоместитьВсеФайлыПакетаВОдинРесурс(Ресурс, ЗаписанныйФайлОбъект.Ссылка, Файл);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура помещает файлы в ресурс на основе предварительно сформированного дерева файлов.
//
&НаСервере
Процедура ЗаписатьДеревоФайловРесурса(СтрокиДереваФайлов, Владелец, Родитель = Неопределено)
	
	Если Родитель = Неопределено Тогда
		Родитель = справочники.ФайлыСУЗ.ПустаяСсылка();
	КонецЕсли;
	
	Для каждого Строка Из СтрокиДереваФайлов Цикл
		
		// Ищем существующий файл
		
		СсылкаНаФайл = ПолучитьСуществующийФайл(Владелец, Родитель, Строка.ИмяФайла, Строка.ЭтоКаталог);
			
		// Получаем объект файла
		
		Файл = Новый Файл(Строка.ПутьКФайлу);
		
		Если НЕ Файл.Существует() Тогда
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Файл ""%1"" не найден!'"), Файл.ПолноеИмя);
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ЗаписанныйФайлОбъект = ЗаписатьФайлПакетаВРесурс(Файл, Владелец, Родитель, СсылкаНаФайл);
		
		// Рекурсивно вызываем эту функцию для подчиненных файлов
		
		Если Файл.ЭтоКаталог() Тогда
			ЗаписатьДеревоФайловРесурса(Строка.Строки, Владелец, ЗаписанныйФайлОбъект.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция ищет существующий файл в ресурсе базы по его имени и другим параметрам.
//
&НаСервере
Функция ПолучитьСуществующийФайл(Ресурс, Родитель, ИмяФайла, ЭтоКаталог)
	
	Если НЕ ЗначениеЗаполнено(Родитель) Тогда
		Родитель = Справочники.ФайлыСУЗ.ПустаяСсылка();	
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФайлыСУЗ.Ссылка
	                      |ИЗ
	                      |	Справочник.ФайлыСУЗ КАК ФайлыСУЗ
	                      |ГДЕ
	                      |	ФайлыСУЗ.Владелец = &Владелец
	                      |	И ФайлыСУЗ.Родитель = &Родитель
	                      |	И ФайлыСУЗ.ИмяФайла = &ИмяФайла
	                      |	И ФайлыСУЗ.ЭтоГруппа = &ЭтоГруппа");
	
	Запрос.УстановитьПараметр("Владелец", Ресурс);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	Запрос.УстановитьПараметр("ИмяФайла", ИмяФайла);
	Запрос.УстановитьПараметр("ЭтоГруппа", ЭтоКаталог);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Справочники.ФайлыСУЗ.ПустаяСсылка();
	Иначе
		НайденныйФайл = Результат.Выбрать();
		НайденныйФайл.Следующий();
		Возврат НайденныйФайл.Ссылка;
	КонецЕсли;
	
КонецФункции

// Функция на основе относительного пути к файлу находит его в дереве файлов.
//
&НаСервере
Функция НайтиВДеревеФайлов(ДеревоФайловРесурса, ПутьКФайлу)
	
	ПутьКакМассив   = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(ПутьКФайлу, "\");
	ДлиннаМассива   = ПутьКакМассив.Количество();
	ТекСтрокиДерева = ДеревоФайловРесурса.Строки;
	
	Для А=0 По ДлиннаМассива-1 Цикл
		ТекНайденнаяСтрока = ТекСтрокиДерева.Найти(ПутьКакМассив[А], "ИмяФайла");
		Если ТекНайденнаяСтрока = Неопределено Тогда
			ТекНайденнаяСтрока = Неопределено;
			Прервать;
		Иначе
			ТекСтрокиДерева = ТекНайденнаяСтрока.Строки;
		КонецЕсли;
	КонецЦикла;
	
	Если ТекНайденнаяСтрока <> Неопределено Тогда
		Возврат ТекНайденнаяСтрока.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
				
КонецФункции

// Функция записывает файл с диска в базу данных 
// Создается новый элемент или заменяется существующий.
//
&НаСервере
Функция ЗаписатьФайлПакетаВРесурс(Файл, Владелец, Родитель, ЭлементДляЗамены = Неопределено)
	
	Если ЗначениеЗаполнено(ЭлементДляЗамены) Тогда
		
		НовыйЭлемент = ЭлементДляЗамены.ПолучитьОбъект();
		
	Иначе
		
		Если Файл.ЭтоКаталог() Тогда
			НовыйЭлемент = Справочники.ФайлыСУЗ.СоздатьГруппу();
		Иначе
			НовыйЭлемент = Справочники.ФайлыСУЗ.СоздатьЭлемент();
		КонецЕсли;
		
		РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(НовыйЭлемент);
		
	КонецЕсли;
	
	// Заносим реквизиты
	
	Если НЕ Файл.ЭтоКаталог() Тогда

		НовыйЭлемент.ТипФайла = РазработкаСУЗКлиентСервер.ПолучитьТипФайлаПоРасширению(Файл.Расширение);
		НовыйЭлемент.ТипОбъектаСУЗ = Перечисления.ТипыОбъектовСУЗ.file;
		
		Если НовыйЭлемент.Версия = 0 Тогда
			НовыйЭлемент.Версия = 1;
		Иначе
			НовыйЭлемент.Версия = НовыйЭлемент.Версия;
		КонецЕсли;
		
		Если НовыйЭлемент.ТипФайла = Перечисления.ТипыФайловСУЗ.Media Тогда
			НовыйЭлемент.Ширина      = "100%";
			НовыйЭлемент.Высота      = "100%";
			НовыйЭлемент.FlashВерсия = 8;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Родитель) Тогда
		НовыйЭлемент.Родитель = Родитель;
	КонецЕсли;
	
	НовыйЭлемент.Владелец = Владелец;
	НовыйЭлемент.ИмяФайла = Файл.Имя;
	НовыйЭлемент.Наименование = Файл.Имя;
		
	// Сохраняем данные
	
	НовыйЭлемент.ДополнительныеСвойства.Вставить("ПропуститьКонтрольУникальностиИмениФайла", Истина); // Для увеличения производительности
	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	НовыйЭлемент.Записать();
	
	Если НЕ Файл.ЭтоКаталог() Тогда
	
		РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(НовыйЭлемент, НовыйЭлемент.Наименование, "Описание");
		
		ДвоичныеДанныеФайла = Новый ДвоичныеДанные(Файл.ПолноеИмя);
				
		// Двоичные данные появляются в процедуре ПередЗаписью модуля справочника ФайлыСУЗ.
		РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(НовыйЭлемент, ДвоичныеДанныеФайла, "ДвоичныеДанные", "ДвоичныеДанные");
		
	КонецЕсли;
		
	Возврат НовыйЭлемент;
	
КонецФункции

// Обеспечение повторного импорта пакета

// Процедура запоминает, что элемент пакета данных SCORM был импортирован в базу данных.
//
&НаСервере
Процедура ЗапомнитьИмпортЭлемента(СсылкаНаЭлемент, ИдентификаторЭлемента, ИмяЭлемента)
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйРесурсДляЗамены) Тогда
		ВызватьИсключение НСтр("ru = 'Электронный ресурс для замены не заполнен'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
		ВызватьИсключение НСтр("ru = 'Ссылка на элемент не заполнена'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИмяЭлемента) Тогда
		ВызватьИсключение НСтр("ru = 'Имя элемента не заполнено'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПакета) Тогда
		ВызватьИсключение НСтр("ru = 'Идентификатор пакета не заполнено'");
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ИмпортированныеЭлементыПакетаSCORM.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.СсылкаНаЭлемент.Установить(СсылкаНаЭлемент);

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.СсылкаНаЭлемент       = СсылкаНаЭлемент;
	НоваяЗапись.ИдентификаторПакета   = ИдентификаторПакета;
	НоваяЗапись.ИмяЭлемента           = ИмяЭлемента;
	НоваяЗапись.ЭлектронныйРесурс     = ЭлектронныйРесурсДляЗамены;
	НоваяЗапись.ИдентификаторЭлемента = ИдентификаторЭлемента;
		
	НаборЗаписей.Записать();
	
	ТаблицаРанееИмпортированныхЭлементов = Неопределено;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуРанееИмпортированныхЭлементов()
	
	Если ТаблицаРанееИмпортированныхЭлементов = Неопределено Тогда
	
		Запрос = Новый Запрос();		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИмпортированныеЭлементыПакетаSCORM.СсылкаНаЭлемент КАК СсылкаНаЭлемент,
		               |	ИмпортированныеЭлементыПакетаSCORM.ИдентификаторЭлемента КАК ИдентификаторЭлемента,
		               |	ИмпортированныеЭлементыПакетаSCORM.СсылкаНаЭлемент.ЭтоГруппа КАК ЭтоГруппа,
		               |	ИмпортированныеЭлементыПакетаSCORM.ИмяЭлемента КАК ИмяЭлемента,
		               |	ИмпортированныеЭлементыПакетаSCORM.ДатаИзменения КАК ДатаИзменения,
		               |	ИмпортированныеЭлементыПакетаSCORM.ЭлектронныйРесурс КАК ЭлектронныйРесурс
		               |ИЗ
		               |	РегистрСведений.ИмпортированныеЭлементыПакетаSCORM КАК ИмпортированныеЭлементыПакетаSCORM
		               |ГДЕ
		               |	ИмпортированныеЭлементыПакетаSCORM.ИдентификаторПакета = &ИдентификаторПакета";
		
		Запрос.УстановитьПараметр("ИдентификаторПакета", ИдентификаторПакета);
		
		ТаблицаРанееИмпортированныхЭлементов = Запрос.Выполнить().Выгрузить();
		
		ТаблицаРанееИмпортированныхЭлементов.Сортировать("ДатаИзменения");
		
	КонецЕсли;
	
	Возврат ТаблицаРанееИмпортированныхЭлементов;
		
КонецФункции

&НаСервере
Функция ПолучитьРанееИмпортированныеЭлементы(ИмяЭлемента)
	
	ТаблицаЭлементов = ПолучитьТаблицуРанееИмпортированныхЭлементов();
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяЭлемента", ИмяЭлемента);
	
	Возврат ТаблицаЭлементов.НайтиСтроки(СтруктураОтбора);
			
КонецФункции

// Функция проверяет был ли элемент пакета импортирован ранее.
// Если импорт был, то возвращает данный элемент.
//
&НаСервере
Функция ПолучитьРанееИмпортированныйЭлемент(ИдентификаторЭлемента, ИмяЭлемента, ЭтоГруппа = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйРесурсДляЗамены) Тогда
		ВызватьИсключение НСтр("ru = 'Электронный ресурс для замены не заполнен'");
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(ИмяЭлемента) Тогда
		ВызватьИсключение НСтр("ru = 'Имя элемента не заполнено'");
	КонецЕсли;
		
	ТаблицаЭлементов = ПолучитьТаблицуРанееИмпортированныхЭлементов();
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИдентификаторЭлемента", ИдентификаторЭлемента);
	СтруктураОтбора.Вставить("ИмяЭлемента", ИмяЭлемента);
	СтруктураОтбора.Вставить("ЭлектронныйРесурс", ЭлектронныйРесурсДляЗамены);
	
	Если ТипЗнч(ЭтоГруппа) = Тип("Булево") Тогда
		СтруктураОтбора.Вставить("ЭтоГруппа", ЭтоГруппа);
	КонецЕсли;
	
	НайденныеСтроки = ТаблицаЭлементов.НайтиСтроки(СтруктураОтбора);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НайденныеСтроки.Количество() > 1 Тогда
		ТекстОшибки  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Найдено более одного элемента типа %2 с идентификатором %1'"), ИдентификаторЭлемента, ИмяЭлемента); 
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат НайденныеСтроки[0].СсылкаНаЭлемент;
		
КонецФункции

// Импорт организации контента

// Процедура рекурсивно обходит организацию контента SCORM
// И записывает на ее основе содержание свода знаний в базу данных.
//
&НаСервере
Процедура ИмпортироватьЭлементыОрганизацииКонтентаSCORM(СводЗнаний, Родитель = Неопределено, ЭлементыОрганизацииXDTO, КоллекцияРесурсовПакетаXDTO)
	
	Если Родитель = Неопределено Тогда
		Родитель = Справочники.СодержаниеСУЗ.ПустаяСсылка();
	КонецЕсли;
	
	Для каждого ЭлементОрганизации Из ЭлементыОрганизацииXDTO Цикл
		
		ИдентификаторЭлемента = ЭлементОрганизации.identifier;
		КоличествоПодчиненныхЭлементов = ЭлементОрганизации.item.Количество();
		
		Если КоличествоПодчиненныхЭлементов > 0 Тогда
			ЭтоГруппа = Истина;
		Иначе
			ЭтоГруппа = Ложь;
		КонецЕсли;
		
		ЭлементСодержания = ПолучитьРанееИмпортированныйЭлемент(ИдентификаторЭлемента, "item", ЭтоГруппа);
		
		Если ЗначениеЗаполнено(ЭлементСодержания) Тогда
			
			ЭлементСодержанияОбъект = ЭлементСодержания.ПолучитьОбъект();
			
		Иначе
			
			Если ЭтоГруппа Тогда
				ЭлементСодержанияОбъект = Справочники.СодержаниеСУЗ.СоздатьГруппу();
			Иначе
				ЭлементСодержанияОбъект = Справочники.СодержаниеСУЗ.СоздатьЭлемент();	
			КонецЕсли;
			
			РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ЭлементСодержанияОбъект);
			
		Конецесли;
		
		ЭлементСодержанияОбъект.Наименование = ЭлементОрганизации.title;
		ЭлементСодержанияОбъект.Родитель = Родитель;
		ЭлементСодержанияОбъект.Владелец = СводЗнаний;
		
		Если НЕ ЭлементСодержанияОбъект.ЭтоГруппа Тогда
			ЭлементСодержанияОбъект.РазрешитьРедактироватьНаименование = Истина;
		КонецЕсли;
				
		Если НЕ ЭтоГруппа Тогда
				
			СсылкаНаРесурс = ПолучитьРанееИмпортированныйЭлемент(ЭлементОрганизации.identifierref, "resource", Ложь);
			
			Если НЕ ЗначениеЗаполнено(СсылкаНаРесурс) Тогда
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не найден ресурс с идентификатором ""%1"".'"), ЭлементОрганизации.identifierref);
				ВызватьИсключение Текст;				
			Иначе				
				ЭлементСодержанияОбъект.СсылкаНаЭлемент = СсылкаНаРесурс;				
			КонецЕсли;
			
		КонецЕсли;
		
		// Проверка необязательных данных
		
		//completionThreshold (Порог выполнения)
		
		Если ЭлементОрганизации.Свойства().Получить("completionThreshold") <> Неопределено Тогда
			
			Если ТипЗнч(ЭлементОрганизации.completionThreshold) = Тип("ОбъектXDTO") Тогда
				Если ЭлементОрганизации.completionThreshold.Свойства().Получить("minProgressMeasure") <> Неопределено Тогда
					ЭлементСодержанияОбъект.ПорогВыполнения = Число(ЭлементОрганизации.completionThreshold.minProgressMeasure);
				КонецЕсли;
			Иначе
				ЭлементСодержанияОбъект.ПорогВыполнения = Число(ЭлементОрганизации.completionThreshold);
			КонецЕсли;
			
			
		КонецЕсли;
		
		//dataFromLMS
		
		Если ЭлементОрганизации.Свойства().Получить("dataFromLMS") <> Неопределено Тогда
			ЭлементСодержанияОбъект.ДанныеИнициализации = Строка(ЭлементОрганизации.dataFromLMS);
		КонецЕсли;
		
		//timeLimitAction
		
		Если ЭлементОрганизации.Свойства().Получить("timeLimitAction") <> Неопределено Тогда
			
			Если ЭлементОрганизации.timeLimitAction = "exit,message" Тогда
				ЭлементСодержанияОбъект.ДействиеПослеИстеченияВремени = Перечисления.ДействияПослеИстеченияВремениВыполненияОбъектаSCORM.СообщитьИВыйти;	
			КонецЕсли;
			
			Если ЭлементОрганизации.timeLimitAction = "exit,no message" Тогда
				ЭлементСодержанияОбъект.ДействиеПослеИстеченияВремени = Перечисления.ДействияПослеИстеченияВремениВыполненияОбъектаSCORM.Выйти;
			КонецЕсли;
			
			Если ЭлементОрганизации.timeLimitAction = "continue,message" Тогда
				ЭлементСодержанияОбъект.ДействиеПослеИстеченияВремени = Перечисления.ДействияПослеИстеченияВремениВыполненияОбъектаSCORM.СообщитьИПродолжитьРаботу;	
			КонецЕсли;
			
			Если ЭлементОрганизации.timeLimitAction = "continue,no message" Тогда
				ЭлементСодержанияОбъект.ДействиеПослеИстеченияВремени = Перечисления.ДействияПослеИстеченияВремениВыполненияОбъектаSCORM.ПродолжитьРаботу;
			КонецЕсли;
			
		КонецЕсли;
		
		// sequencing
		
		Если ЭлементОрганизации.Свойства().Получить("sequencing") <> Неопределено Тогда
			
			Если ЭлементОрганизации.sequencing.Свойства().Получить("limitConditions") <> Неопределено Тогда
				
				// Ограничение количества попыток
				Если ЭлементОрганизации.sequencing.limitConditions.Свойства().Получить("attemptLimit") <> Неопределено Тогда
					ЭлементСодержанияОбъект.КоличествоПопыток = Число(ЭлементОрганизации.sequencing.limitConditions.attemptLimit);	
				КонецЕсли;
				
				// Ограничение времени на попытку
				Если ЭлементОрганизации.sequencing.limitConditions.Свойства().Получить("attemptAbsoluteDurationLimit") <> Неопределено Тогда
					ЭлементСодержанияОбъект.ПродолжительностьПопытки = Строка(ЭлементОрганизации.sequencing.limitConditions.attemptAbsoluteDurationLimit);
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЕсли;
		
		// parameters
		
		Если ЭлементОрганизации.Свойства().Получить("parameters") <> Неопределено
			И ЭлементОрганизации.parameters <> Неопределено Тогда
			
				СтрокаПараметров = Строка(ЭлементОрганизации.parameters);
				ПозицияВопроса = Найти(СтрокаПараметров, "?");
				
				Если ПозицияВопроса > 0 Тогда
					СтрокаПараметров = Сред(СтрокаПараметров, ПозицияВопроса+1, СтрДлина(СтрокаПараметров));
				КонецЕсли;
			
				ЭлементСодержанияОбъект.ПараметрыЗапуска = СтрокаПараметров;	
				
		КонецЕсли;
		
		ЭлементСодержанияОбъект.Записать();
		
		ЗапомнитьИмпортЭлемента(ЭлементСодержанияОбъект.Ссылка, ИдентификаторЭлемента, "item"); //resources - означает, что хранятся все ресурсы, а не один.
		
		Если ЭтоГруппа Тогда
			ИмпортироватьЭлементыОрганизацииКонтентаSCORM(СводЗнаний, ЭлементСодержанияОбъект.Ссылка, ЭлементОрганизации.item, КоллекцияРесурсовПакетаXDTO);
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция ПакетСодержитНесколькоЭлектронныхРесурсов()
	
	МанифестXDTO = ПолучитьМанифестXDTO();
	
	КоличествоОрганизаций = МанифестXDTO.organizations.organization.Количество();
	
	Если КоличествоОрганизаций > 1 Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция БудетВыполненаЗаменаПакетаВЭлектронномРесурсе()
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйРесурсДляЗамены) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РанееИмпортированныйЭлектронныйРесурс = ПолучитьРанееИмпортированныйЭлемент(
		ОрганизацияДляЗагрузки().identifier, "organization", Ложь);
		
	Если РанееИмпортированныйЭлектронныйРесурс = ЭлектронныйРесурсДляЗамены Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция БудетВыполненоДобавлениеПакетаВЭлектронныйРесурс()
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйРесурсДляЗамены) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РанееИмпортированныйЭлектронныйРесурс = ПолучитьРанееИмпортированныйЭлемент(
		ОрганизацияДляЗагрузки().identifier, "organization", Ложь);
		
	Если РанееИмпортированныйЭлектронныйРесурс = ЭлектронныйРесурсДляЗамены Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ОрганизацияДляЗагрузки()
	
	МанифестXDTO = ПолучитьМанифестXDTO();	
	
	Возврат МанифестXDTO.organizations.organization[0];	
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЭлектронныеРесурсыДляЗамены()

	ЭлектронныеРесурсыДляЗамены.Очистить();
	
	ТаблицаЭлектронныхРесурсов = ПолучитьРанееИмпортированныеЭлементы("organization");
	
	Для каждого СтрокаТЭР Из ТаблицаЭлектронныхРесурсов Цикл	
		
		НоваяСтрока = ЭлектронныеРесурсыДляЗамены.Добавить();
		НоваяСтрока.ЭлектронныйРесурс = СтрокаТЭР.СсылкаНаЭлемент;
		НоваяСтрока.ДатаИзменения = СтрокаТЭР.ДатаИзменения;
		
		ЭлектронныйРесурсДляЗамены = СтрокаТЭР.СсылкаНаЭлемент;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Параметры.ЭлектронныйРесурсДляЗамены) Тогда
		ЭлектронныйРесурсДляЗамены = Параметры.ЭлектронныйРесурсДляЗамены;
	КонецЕсли;
	
КонецПроцедуры

// Интерфейс

// Устанавливает доступность элементов формы
//
&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Элементы.ДекорацияДобавление.Видимость = БудетВыполненоДобавлениеПакетаВЭлектронныйРесурс();
	Элементы.ДекорацияЗамена.Видимость = БудетВыполненаЗаменаПакетаВЭлектронномРесурсе();
	Элементы.ДекорацияНовый.Видимость = НЕ ЗначениеЗаполнено(ЭлектронныйРесурсДляЗамены);
	
	Элементы.ДекорацияНесколькоOrganization.Видимость = ПакетСодержитНесколькоЭлектронныхРесурсов();
	
КонецПроцедуры


#КонецОбласти
